# STLExportOptions Properties (2023)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2023 API
---
STLExportOptions Properties
STLExportOptions Class See Also
---
The STLExportOptions type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ExportBinary | True to export in binary STL format, false to export in ASCII STL format. Default value is true. |
| ExportColor | True to export color information, false otherwise. Default value is false. |
| GridAspectRatio | The maximum aspect ratio allowed in the grid placed across the face. The minimum allowed value is 1.0. The maximum allowed value is 10.0. By default this property is ignored. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from ATFBaseExportOptions.) |
| MaxEdgeLength | The maximum length allowed for any chord on an edge or between any two adjacent grid lines. This is a percentage value. By exporting, the real value of maximum edge length is calculated as a percent from the length of the diameter of the body bounding box. The minimum allowed value is 0.1%. The maximum allowed value is 10.0%. By default this property is ignored. |
| NormalTolerance | The maximum change in the surface normal between adjacent nodes in the mesh. This property is defined in degrees. The minimum allowed value is 1.0 degrees. The maximum allowed value is 45.0 degrees. Default value is 15.0 degrees. |
| SurfaceTolerance | The maximum distance between mesh triangles and model geometry. This is a percentage value. By exporting, the real value of surface tolerance is calculated as a percent from the length of the diameter of the body bounding box. The minimum allowed value is 0.001%. The maximum allowed value is 1.0%. Default value is 0.1%. |
| TargetUnit | The unit type of geometry in the resultant STL file. Default value is ExportUnit::Default. |
| ViewId | The element id of the 3D view to export. InvalidElementId by default.  (Inherited from ATFBaseExportOptions.) |

# See Also
STLExportOptions Class
Autodesk.Revit.DB Namespace